Revit 2027 API
BuiltInFailures.RebarFailures.RebarCrankOverHook Property
 Cannot add crank to the end that already has a hook.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RebarCrankOverHook { get; }
Public Shared ReadOnly Property RebarCrankOverHook As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RebarCrankOverHook {
	FailureDefinitionId^ get ();
}
static member RebarCrankOverHook : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace